from sys import argv

script, first, second, third = argv

print('Этот сценарий называеться: ', script)
print('Моя первая переменная називаеться: ', first)
print('Моя вторая переменная називаеться: ', second)
print('Моя треться переменная называеться: ', third)

first = input('Переименуйте первую переменную ')
second = input('Переименуйте вторую переменную ')
third = input('Переименуйте третью переменную ')

print('Моя первая переменная називаеться: ', first)
print('Моя вторая переменная називаеться: ', second)
print('Моя треться переменная называеться: ', third)