print("Я подсчитаю свою живность")

# Обозначаем живность
print("Куры", 25 + 30 / 6) # Должно быть 30.0
print("Петухи", 100 - 25 * 3 % 4) # Должно быть 97

print("А теперь подсчитаю яйца:")

# Теперь считаем яйца
print(3 + 2 + 1 - 5 + 4 % 2 - 1 / 4 + 6) # Должно быть 6.75
print("Верно ли, что 3 + 2 < 5 - 7?")

print(3 + 2 < 5 - 7) # Должно быть False

print("Сколько будет 3 + 2?", 3 + 2) # Должно быть 5
print("Сколько будет 5 - 7?", 5 - 7) # Должно быть -2

print("Ой, я, кажеться, запутался... Почему False?")

print("Еще раз подсчитаю...")

print("Это больше?", 5 > - 2) # Должно быть True
print("А это больше или равно?", 5 >= -2) # Должно быть True
print("А это меньше или равно?", 5 <= -2) # Должно быть False